* Introduction
  :PROPERTIES:
  :CUSTOM_ID: section-intro
  :END:

** TODO Abstract

This document is a demonstration of the [[thing:org-spec][thi.ng/org-spec]] template,
primarily intended to simplify the creation & maintenance of technical
specifications written in Org-mode.

All diagrams in this document are autogenerated from embedded code
block snippets in the original =.org= file. See [[#section-build-doc][Appendix B]] for more
information.

Brief outline description of the document[fn:intro]...

[fn:intro] Example footnote, can also contain [[thing:org-spec][links]].

** DONE Scope

Topics covered by this specification:

- [[#section-sys-arch][System architecture]] - design guidelines, data models, roles &
  responsibilities
- [[#section-client-server][Client / server communication]] - protocols and implementation details
  between system modules

** Status of This Document

*May Be Superseded*

This section describes the status of this document at the time of its
publication. Other documents may supersede this document.

#+HTML: <div class="notice notice-info">
*Changes since the last version*

#+BEGIN_COMMENT
In order for the changelog to work, please change the =tag= variable
for the code block below to the tag of your last published version.
#+END_COMMENT

#+HTML: <ul>

#+BEGIN_SRC sh :exports results :results value html :var TAG="v0.0"
  RES=`git log $TAG...HEAD --pretty="<li>%s</li>" -- index.org sections/*.org`
  if [ -z $RES ]; then
    RES="<li>no changes</li>"
  fi
  echo $RES
#+END_SRC

#+RESULTS:
#+BEGIN_HTML
#+END_HTML

#+HTML: </ul>
#+HTML: </div>

** Conventions

The key words *MUST*, *MUST NOT*, *REQUIRED*, *SHOULD*, *SHOULD NOT*,
*RECOMMENDED*, *MAY*, and *OPTIONAL* in this specification are to be
interpreted as described in [[rfc:2119][RFC2119]].

Since a document and project of this nature deals with a large number
of technologies, each with their own set of acronyms, please refer to
the glossary in [[#section-glossary][Appendix A]], which briefly explains some of them.

*** Definition of project specific terms

In this document:

- Term A :: is a...
- Term B :: is a...
